W6D5/Ninecats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        # debugger
        # find laugh by its id
        @cats = Cat.find(params[:id]) # params is hash like obj, key into at key of id to get value